month_list = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]
month_dict = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень",
              10: "Осень", 11: "Осень", 12: "Зима"}

try:
    month_num = int(input("Введите номер месяца: "))
except :
    print(f"Это не число")
else:
    if 1 <= month_num <= 12:
        print(f"По верссии List это время года {month_list[month_num - 1]}")
        print(f"По верссии Dictionary это время года {month_dict.get(month_num)}")
    else:
        print(f"Это не номер месяца")

